In [1]:
from utils.query_db import db_connection

How many payment transactions were greater than $5.00?

In [2]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(payment_id)
                      FROM payment
                      WHERE amount > 5;""")

   count
0   3618

How many actors have a first name that starts with the letter P?

In [3]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(first_name)
                      FROM actor 
                      WHERE first_name LIKE 'P%';""")

   count
0      5

How many unique districts are our customers from?

In [4]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(DISTINCT(district))
                      FROM address;""")

   count
0    378

Retrieve the list of names for those distinct districts from the previous question.

In [5]:
with db_connection() as conn:
    conn.fetch_all("""SELECT DISTINCT(district)
                      FROM address;""")

            district
0               Aden
1    Eastern Visayas
2              Vaduz
3              Tokat
4          Anzotegui
..               ...
373   Rostov-na-Donu
374             Sind
375          Nghe An
376           Ktahya
377         Veracruz

[378 rows x 1 columns]

How many films have a rating of R and a replacement cost between $5 and $15?

In [6]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(title)
                      FROM film
                      WHERE rating = 'R'
                                AND
                            replacement_cost BETWEEN 5 AND 15;""")

   count
0     52

How many films have the word Truman somewhere in the title?

In [7]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(title)
                      FROM film
                      WHERE title LIKE '%Truman%';""")

   count
0      5

Return the customer IDs of customers who have spent at least $110 with the staff member who has an ID of 2.

In [8]:
with db_connection() as conn:
    conn.fetch_all("""SELECT customer_id,
                             SUM(amount) as amount_spent
                      FROM payment
                      WHERE staff_id = '2'
                      GROUP BY customer_id
                      HAVING SUM(amount) >= 110;""")

   customer_id amount_spent
0          187       110.81
1          148       110.78

 How many films begin with the letter J?

In [9]:
with db_connection() as conn:
    conn.fetch_all("""SELECT COUNT(title)
                      FROM film
                      WHERE title ILIKE 'j%';""")

   count
0     20

What customer has the highest customer ID number whose name starts with an 'E' and has an address ID lower than 500?

In [10]:
with db_connection() as conn:
    conn.fetch_all("""SELECT customer_id,
                             first_name,
                             last_name
                      FROM customer
                      WHERE customer_id < 500
                        AND first_name LIKE 'E%'
                      ORDER BY customer_id DESC
                      LIMIT 1;""")

   customer_id first_name last_name
0          434      Eddie    Tomlin